[
  {
    "categoryid": 0,
    "id": 0,
    "name": "Куринная лапша",
    "description": "Такой супчик несомненно понравится и маленьким, и взрослым.",
    "cookingSteps": [ "1. Картофель помыть, очистить и нарезать средними кубиками.", "2. Морковь помыть, очистить и натереть на крупной терке.", "3. Гречневую крупу перебрать, промыть и просушить на раскаленной сковороде без растительного масла в течение 4-5 минут (до легкого потрескивания гречки), постоянно помешивая. Так гречневая крупа придаст нашему супу более выразительный вкус и аромат.", "4. В кастрюлю подходящего размера влить воду, поставить на огонь. Довести воду до кипения. После закипания воды поместить в кастрюлю картофель.", "5. Затем  добавить гречневую крупу. Все хорошо перемешать и посолить. После повторного закипания уменьшить огонь и варить картошку с гречкой примерно 15-20 минут (до полуготовности картофеля и гречки), постоянно снимая образовавшуюся пену.", "6. Тем временем приготовить фрикадельки: из куриного филе сделать фарш, посолить, поперчить по вкусу, добавить 1 столовую ложку сметаны, тщательно перемешать.", "7. Мокрыми руками скатать небольшие шарики (фрикадельки). Когда картошка и гречка сварятся до полуготовности, аккуратно опустить в суп фрикадельки и продолжать варить 7- 10 минут.", "8. Пока варится суп, в сковороде разогреть немного растительного масла, выложить натертую морковь, хорошо перемешать и обжаривать на среднем огне до мягкости, в течение 4-5 минут, иногда помешивая.", "9. В кипящий гречневый суп с фрикадельками выложить обжаренную морковь, добавить лавровый лист, любимую приправу для супа и варить еще несколько минут на маленьком огне." ],
    "ingredients": [ "Вода - 2 л", "Спагетти - 100 г", "Репчатый лук - 1 штука", "Морковь - 1 штука", "Куриное яйцо - 2 штуки", "Лавровый лист - 3 штуки", "Зеленый лук - по вкусу", "Оливковое масло - 2 столовые ложки", "Курица - 1,2 штуки" ]
  },
  {
    "categoryid": 0,
    "id": 1,
    "name": "Гречневый с фрикадельками",
    "description": "Полезный, вкусный и питательный суп больного на ноги поставит! Куриная лапша – сытная и аппетитная еда, которая очень понравятся вашим любимым.",
    "cookingSteps": [ "1 Половину курицы помыть, разрезать на две части и положить в глубокую кастрюлю.", "2 В кастрюлю с курицей налить два литра холодной воды и варить на медленном огне 1,5 часа.", "3 За час до готовности добавить соль и специи.", "4 Пока варится бульон, мелко нарезать репчатый лук, натереть на крупной терке морковь и обжарить с оливковым маслом на среднем огне.", "5 Яйцо отварить.", "6 Готовую курицу достать из кастрюли и разделить на кусочки.", "7 В бульон добавить обжаренный лук и морковь.", "8 Затем добавить спагетти и варить еще пять минут.", "9 Готовый суп разлить по тарелкам, положить несколько кусочков курицы, сверху половину яйца, украсить зеленым луком." ],
    "ingredients": [ "Вода - 2 л", "Спагетти - 100 г", "Репчатый лук - 1 штука", "Морковь - 1 штука", "Куриное яйцо - 2 штуки", "Лавровый лист - 3 штуки", "Зеленый лук - по вкусу", "Оливковое масло - 2 столовые ложки", "Курица - 1,2 штуки" ]
  },
  {
    "categoryid": 0,
    "id": 2,
    "name": "Окрошка",
    "description": "В жаркую погоду еда должна быть легкой и освежающей. Этим параметрам идеально соответствует окрошка.",
    "cookingSteps": [ "1. Отвариваем мясо, яйца и картофель.", "2. Огурцы очищаем от кожицы, нарезаем кубиками, лук шинкуем.", "3. Кефир смешиваем с теплой кипяченой водой (можно взять холодную минеральную), добавляем соль, сахар, ставим в холодильник.", "4. Перед подачей кладем в миску все нарезанные продукты, заливаем кефиром с водой, посыпаем нарезанным укропом." ],
    "ingredients": [ "Кефир – 600 г", "Вода – 600 г", "Куриное филе – 440 г", "Зеленый лук – 150 г", "Огурец – 300 г", "Картофель – 270 г", "Яйцо – 2 штуки", "Сахар – 20 г", "Соль, укроп – по вкусу" ]
  },
  {
    "categoryid": 1,
    "id": 3,
    "name": "Картошка по-французки",
    "description": "Рецепт картофеля по французски, проверенный годами. Всегда получается вкусно и красиво. Подходит для любого торжества, так как является очень сытным, с большим количеством порций.",
    "cookingSteps": [ "1 Отбить мясо перед нарезкой — это делает его нежным и оно просто тает во рту. Нарезать на небольшие кубики, посолить, поперчить, добавить измельченный чеснок. Все перемешать и оставляю на 5−10 минут.", "2 Выложить мясо первым слоем в форму для запекания. Добавить измельченный зеленый лук.", "3 Почистить и нарезать стружкой картофель. Посолить, поперчить, добавить специи по вкусу. Разложить ровным толстым слоем сверху мяса.", "4 Сливки слегка подсолить, добавить специи и влить в форму.", "5 Разогреть духовку до 200 °C.", "6 Натереть сыр и посыпать картошку.", "7 Выпекать 40-45 минут." ],
    "ingredients": [ "Картофель — 8−10 штук", "Куриное филе — 0,5 кг", "Сыр — 200 г", "Масло сливочное — 30 г", "Лук зеленый — перо", "Чеснок — 1 зубчик", "Сливки — 0,5 стакана", "Соль — по вкусу", "Специи — по вкусу", "Перец - по вкусу" ]
  },
  {
    "categoryid": 1,
    "id": 4,
    "name": "Тефтели",
    "description": "Домашние мясные шарики с рисом – блюдо на все времена. Нежный вкус тефтелей с ароматным сливочно-томатным соусом – понравится точно! Готовить просто и достаточно легко. Рецепт приготовления в духовке, с использованием сковороды. Подавать можно с любым гарниром по вкусу.",
    "cookingSteps": [ "1. Из куриного филе сделать фарш.", "2. Отварить до полуготовности рис.", "3. Нарезать мелкими кубиками лук.", "3. Смешать фарш с измельченным луком и рисом.", "4. Добавить яйцо, соль, перец и чеснок – по вкусу. Тщательно смешать и отбить.", "5. Сформировать тефтели.", "6. Укладываем на лист с пекарской бумагой, запекаем при 200 градусах – 25 минут.", "7. Для соуса: обжариваем лук и морковь (на крупной терке) в растительном масле.", "8. Смешиваем томат, сметану и муку, добавим кипяченную холодную воду.", "9. Вливаем соус к овощам, и доводим до нужной густоты, доливая горячей воды.", "10. 5-7 минут держим на плите.", "11. Запеченные тефтели можно залить соусом и запечь еще 25 минут в духовке.", "12. Выложить их в сковороду, накрыть крышкой и тушить в соусе еще 15-20 минут. Готово!" ],
    "ingredients": [ "Куриное филе - 500 г", "Яйцо - 1 штука", "Рис сырой - 100 г", "Лук репчатый - 2 штуки", "Морковь - 1 штука", "Сметана - 1 столовая ложка", "Томатная паста - 1 столовая ложка", "Мука - 1 столовая ложка", "Оливковое масло - 2 столовые ложки", "Соль - по вкусу", "Сахар - по вкусу", "Перец - по вкусу", "Чеснок - 2 зубчика", "Вода - по вкусу" ]
  },
  {
    "categoryid": 1,
    "id": 5,
    "name": "Паста",
    "description": "Не знаете, какой бы простой соус для макарон в домашних условиях приготовить? Тогда вот вам отличный вариант с томатами и специями. На его создание нужно совсем немного времени!",
    "cookingSteps": [ "1. В сотейник или на сковороду с высокими бортами налейте немного оливкового масла. Нарежьте лук, выложите его в масло, обжарьте до прозрачности. Измельчите чеснок, добавьте на сковороду и обжарьте еще пару минут, помешивая.", "2. Свежие помидоры вымойте, очистите от кожицы и нарежьте мелкими кубиками. Добавьте соль, сахар и специи по вкусу.", "3. Аккуратно все перемешайте, доведите до кипения и на среднем огне томите 10-15 минут, периодически помешивая.", "4. Если хотите, чтобы соус был более однородным, снимите с огня и через пару минут измельчите немного блендером.", "5. После снова отправьте на огонь и доведите до кипения. Вот и весь секрет, как приготовить простой соус для макарон.", "6. Отварите спагетти.", "7. Выложите готовые спагетти в соус и  перемешайте аккуратно — и можно подавать блюдо к столу. Приятного аппетита!" ],
    "ingredients": [ "Репчатый лук - 1 штука", "Чеснок - 3-4 зубчика", "Оливковое масло 1 столовая ложка", "Помидоры - 800 г", "Соль - 1 чайная ложка", "Сахар - 1 чайная ложка", "Перец - 1 щепотка", "Спагетти - 200 г" ]
  },
  {
    "categoryid": 2,
    "id": 6,
    "name": "Цезарь",
    "description": "Один из самых популярных салатов, приготовленный дома! Салат-легенда, названный так совсем не в честь римского императора, а взявший имя шеф-повара Цезаря Кардини, который, по легенде, накормил однажды голливудских актеров салатом из того, что было.",
    "cookingSteps": [ "1. Промыть, просушить и нарвать на небольшие кусочки листья салата, отложить в холодильник.", "2. В горячую сковородку положить 1 столовую ложку сливочного масла. После того, как оно полностью расплавится и начнет шипеть, кинуть нарезанный на пластины зубчик чеснока.", "3. Куриную грудку нарезать на кусочки приблизительно 1х3 см. Положить в сковороду к чесноку и маслу. Обжаривать на сильном огне приблизительно 10 минут до румяной корочки. Снять с огня.", "4. В ту же сковородку добавить еще одну столовую ложку сливочного масла и второй зубчик чеснока. В это время нарезать на небольшие кубики хлеб. Положить в сковороду и обжаривать до румяной корочки. Желательно непрерывно помешивать, чтобы не подгорело.", "5. Достать листья салата, туда же положить обжаренную куриную грудку, помидоры, нарезанные тонкой соломкой. Заправить соусом «Цезарь». Перемешать. Сверху положить получившиеся сухарики и натереть сыр." ],
    "ingredients": [ "Зеленый салат - 1 пучок", "Помидоры - 1 штука", "Куриное филе - 300 г", "Белый хлеб - 6 кусков", "Соус «Цезарь» - по вкусу", "Сливочное масло - 2 столовые ложки", "Чеснок - 2 зубчика", "Сыр - по вкусу" ]
  },
  {
    "categoryid": 2,
    "id": 7,
    "name": "Летний",
    "description": "Хрустящий яркий салат порадует своей легкостью в летнюю жару! А если ингредиенты растут на собственной грядке — будет вдвойне вкусно!",
    "cookingSteps": [ "1. Помидоры нарезать дольками, удалив хвостики.", "2. Огурцы нарезать полукольцами.", "3. Мелко порезать лук.", "4. Заправить салат маслом и посолить." ],
    "ingredients": [ "Помидор - 4 штуки", "Огурец - 2 штуки", "Зеленый лук - 1 пучок", "Оливковое масло - 1 столовая ложка", "Соль - по вкусу" ]
  },
  {
    "categoryid": 2,
    "id": 8,
    "name": "Салат с курицей и ананасом",
    "description": "Салат из курицы и ананасов – один из самых вкусных и несложных. Это классическое кулинарное сочетание. Кисло-сладкие фрукты придают суховатому куриному мясу сочность.",
    "cookingSteps": [ "1. Отварите курицу и остудите её.", "2. Нарежьте филе и ананас небольшими кусочками.", "3. Сыр натрите на мелкой тёрке.", "4. Соедините ингредиенты, оставив немного сыра для украшения.", "5. Смешайте майонез и измельчённый чеснок.", "6. Заправьте салат, подсолите и перемешайте.", "7. Посыпьте оставшимся сыром. Перед подачей дайте блюду немного настояться." ],
    "ingredients": [ "Куриное филе - 400 г", "Консервированный ананас - 300 г", "Сыр - 15-200 г", "Майонез - 3 столовые ложки", "Чеснок - 2 зубчика", "Соль — по вкусу" ]
  }
]